---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.DirectoryNotFoundException
source: html/8d05986b-7c41-4367-0622-e09ed2aeccab.htm
---
# DirectoryNotFoundException Methods

Retrieves data needed to serialize the target object.